'''
비트 연산자

    즉 비트로 변환한 뒤에 비트 단위로 연산 수행

    1. &(and) : 입력이 모두 1이면 1, 아니면 0
    2. |(or) : 입력 중 하나라도 1이면 1, 아니면 0
    3. ^(xor) : 입력이 서로 다르면 1, 아니면 0
    4. ~(not) : 입력이 0이면 1, 입력이 1이면 0
    5. <<(왼쪽 shift) : 비트 단위로 왼쪽으로 N비트 이동하며
                     2의 N 거듭제곱만큼 곱셈
    6. >>(오른쪽 shift) : 비트 단위로 오른쪽으로 N비트 이동하며 2의 N거듭제곱만큼 나눗셈
    * 키오스크에 쓰임
'''

a = 6
b = 5
print('a & b : {}'.format(a & b))
print('a | b : {}'.format(a | b))
print('a ^ b : {}'.format(a ^ b))
print('~a : {}'.format(~a))
print('a << 1 : {}'.format(a << 1))
print('a >> 1 : {}'.format(a >>1))
"""
a = 6 --> 0110
b = 5 --> 0101
"""
# 컴퓨터는 음수표현 -> 2의 보수(1의 보수 + 1)

